#!/bin/bash

echo "\$0 = $0"       # 输出该脚本的脚本名称
echo "\$1 = $1"       #输出第一个参数内容
echo "\$2 = $2"
echo "\$3 = $3"
echo "\$4 = $4"
echo "\$5 = $5"
echo "\$6 = $6"
echo "\$10 = ${10}" #输出第10个参数内容
echo "\$# =  $#"    #输出参数的数量


echo "\$@ = $@"     # 输出所有参数的内容
echo "\$* = $*"     #输出所有参数的内容
echo "\$$ = $$"     # 输出当前进程编号
ls file
echo "\$? = $?"     # 输出上一次执行命令后的返回值

:<<!
file 文件本身存在的前提
bash.pos.sh 1 2 3 4 5 6 7 8 9 10 11

$0 = pos.sh
$1 = 1
$2 = 2
$3 = 3
$4 = 4
$5 = 5
$6 = 6
$10 = 10
$# =  11
$@ = 1 2 3 4 5 6 7 8 9 10 11
$* = 1 2 3 4 5 6 7 8 9 10 11
$$ = 5794
file
$? = 0








!
